---
kind: property
id: P:Autodesk.Revit.DB.IConnector.Origin
zh: 原点
source: html/5e8de3db-f3b3-033b-2825-a10df6523ec1.htm
---
# Autodesk.Revit.DB.IConnector.Origin Property

**中文**: 原点

The location of the connector in family document.

## Syntax (C#)
```csharp
XYZ Origin { get; }
```

## Remarks
This property is used to retrieve the origin of the connector.